src/Embedded System/DM816x/EDMA Notes.org
#+SETUPFILE: ~/.emacs.d/src/org-templates/level-2.org
#+TITLE: EDMA Notes
#+OPTIONS: num:nil H:3


* Overview
** TMS320C6000 DSP Enhanced Direct Memory Access (EDMA) Controller Reference Guide pdf

** Reconfiguring EDMA channel allocation on ARM(dm646x)
http://processors.wiki.ti.com/index.php/Reconfiguring_EDMA_channel_allocation_on_ARM

** TI81XX EDMA Driver User Guide
http://processors.wiki.ti.com/index.php/TI81XX_EDMA_Driver_User_Guide

** Programming the EDMA3 using the Low-Level Driver (LLD)
http://processors.wiki.ti.com/index.php/Programming_the_EDMA3_using_the_Low-Level_Driver_%28LLD%29
** edma.h File Reference
http://software-dl.ti.com/dsps/dsps_public_sw/sdo_sb/targetcontent/linuxutils/2_24_03/exports/linuxutils_2_24_03/docs/html/edma_8h.html

** Forum 
*** Which DMA (EDMA or QDMA) channels are used by the Codec Engine and Codec Server in DM6467T DVSDK 3.10?
http://e2e.ti.com/support/embedded/linux/f/354/t/140290.aspx?pi36987=1
*** DM6467T Linux driver - how to use EDMA
http://e2e.ti.com/support/embedded/linux/f/354/p/104964/506774.aspx#506774


** Trace in Framework Components
http://processors.wiki.ti.com/index.php/Trace_in_Framework_Components
* Note from TI81XX EDMA Driver User Guide
** Introduction
The EDMA3 controller consists of two principal blocks:
+ EDMA3 channel controller (EDMA3CC)
+ EDMA3 transfer controller(s) (EDMA3TC

** How to reserve different EDMA3 resources (DMA channels, TCCs, PaRAM Sets) on ARM side 
The resource allocation in EDMA3 is based on *a pre-aligned static configuration*. 
*** DMA Channels
In the source file =arch\arm\mach-omap2\devices.c=, array
=ti816x_dma_rsv_chans[][2]= is used to reserve various DMA channels to
the shadow regions of all other masters other than ARM. 

#+begin_src c
static const s16 ti816x_dma_rsv_chans[][2] = {
	/* (offset, number) */
	{0, 4},
	{26, 6},
	{48, 4},
	{56, 8},
	{-1, -1}
};
#+end_src
The first entry means 4 channels from channel '0' i.e. channels '0-3'
will be reserved for usage of other masters (for eg. DSP).

*** TCCs (i.e Interrupt channels)
It is assumed that if a particular channel number x is reserved for a
particular master then the TCC x is also reserved for that same
master. All drivers and applications running on all masters must keep
this in mind and be programmed.
*** PaRAM Sets
In the source file =arch\arm\mach-omap2\devices.c=, array
=ti816x_dma_rsv_slots[][2]= is used to reserve various PARAM sets (slot)
to the shadow regions of all other masters other than ARM. 

#+begin_src c
static const s16 ti816x_dma_rsv_slots[][2] = {
	/* (offset, number) */
	{0, 4},
	{26, 6},
	{48, 4},
	{56, 8},
	{64, 127},
	{-1, -1}
};
#+end_src
The first entry means 4 slots from slot '0' i.e. slots '0-3' will be
reserved for usage of other masters (for eg. DSP).

 *Note 1:* DMA channels and PaRAM Sets are one-to-one mapped, meaning
thereby DMA channel X can ONLY use PaRAM Set X for its working. 

 *Note 2:* A DMA/QDMA channel also require a TCC for correct functioning.
By default, DMA channels and TCCs are one-to-one mapped, meaning
thereby DMA channel Y can ONLY use TCC Y for its working. (No such
constraint is there for QDMA channels.) 

** How to change various other global settings
*** How to change default event queue (or Transfer Controller, TC) priorities?
Array =ti816x_queue_priority_mapping[][2]= can be used to change the
default event queue priorities. This array is an array of structures
having the first structure member as the event queue number and the
second structure member as the priority. '0' is the highest priority,
'1' is the second highest and so on. 

#+begin_src c
static const s8 ti816x_queue_priority_mapping[][2] = {
        /* {event queue no, Priority} */
        {0, 0},
        {1, 1},
        {2, 2},
        {3, 3},
        {-1, -1}
};
#+end_src


