public_html/Embedded System/DM816x/EDMA Notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>EDMA Notes</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="EDMA Notes"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-11-29T00:48+0800"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./assets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">EDMA Notes</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Overview</a>
<ul>
<li><a href="#sec-1-1">TMS320C6000 DSP Enhanced Direct Memory Access (EDMA) Controller Reference Guide pdf</a></li>
<li><a href="#sec-1-2">Reconfiguring EDMA channel allocation on ARM(dm646x)</a></li>
<li><a href="#sec-1-3">TI81XX EDMA Driver User Guide</a></li>
<li><a href="#sec-1-4">Programming the EDMA3 using the Low-Level Driver (LLD)</a></li>
<li><a href="#sec-1-5">edma.h File Reference</a></li>
<li><a href="#sec-1-6">Forum</a>
<ul>
<li><a href="#sec-1-6-1">Which DMA (EDMA or QDMA) channels are used by the Codec Engine and Codec Server in DM6467T DVSDK 3.10?</a></li>
<li><a href="#sec-1-6-2">DM6467T Linux driver - how to use EDMA</a></li>
</ul>
</li>
<li><a href="#sec-1-7">Trace in Framework Components</a></li>
</ul>
</li>
<li><a href="#sec-2">Note from TI81XX EDMA Driver User Guide</a>
<ul>
<li><a href="#sec-2-1">Introduction</a></li>
<li><a href="#sec-2-2">How to reserve different EDMA3 resources (DMA channels, TCCs, PaRAM Sets) on ARM side</a>
<ul>
<li><a href="#sec-2-2-1">DMA Channels</a></li>
<li><a href="#sec-2-2-2">TCCs (i.e Interrupt channels)</a></li>
<li><a href="#sec-2-2-3">PaRAM Sets</a></li>
</ul>
</li>
<li><a href="#sec-2-3">How to change various other global settings</a>
<ul>
<li><a href="#sec-2-3-1">How to change default event queue (or Transfer Controller, TC) priorities?</a></li>
</ul>
</li>
<li><a href="#sec-2-4">Present configuration of EDMA3 resources on DM816X platform:</a></li>
<li><a href="#sec-2-5">Sample test application for EDMA Driver</a></li>
</ul>
</li>
<li><a href="#sec-3">Note from Programming the EDMA3 using the Low-Level Driver (LLD)</a>
<ul>
<li><a href="#sec-3-1">Abstract</a></li>
<li><a href="#sec-3-2">Brief Overview of EDMA3</a></li>
<li><a href="#sec-3-3">Getting to know LLD by example – 9 to show the way</a></li>
</ul>
</li>
<li><a href="#sec-4">Note from TMS320DM816x DaVinci Video Processors (sprugx8.pdf)</a>
<ul>
<li><a href="#sec-4-1">5.7 Setting Up a Transfer</a>
<ul>
<li><a href="#sec-4-1-1">Initiating a DMA/QDMA channel</a></li>
<li><a href="#sec-4-1-2">Parameter set setup</a></li>
<li><a href="#sec-4-1-3">Interrupt setup</a></li>
<li><a href="#sec-4-1-4">Initiate transfer</a></li>
<li><a href="#sec-4-1-5">Wait for completion</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Overview</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">TMS320C6000 DSP Enhanced Direct Memory Access (EDMA) Controller Reference Guide pdf</h3>
<div class="outline-text-3" id="text-1-1">


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">Reconfiguring EDMA channel allocation on ARM(dm646x)</h3>
<div class="outline-text-3" id="text-1-2">

<p><a href="http://processors.wiki.ti.com/index.php/Reconfiguring_EDMA_channel_allocation_on_ARM">http://processors.wiki.ti.com/index.php/Reconfiguring_EDMA_channel_allocation_on_ARM</a>
</p>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">TI81XX EDMA Driver User Guide</h3>
<div class="outline-text-3" id="text-1-3">

<p><a href="http://processors.wiki.ti.com/index.php/TI81XX_EDMA_Driver_User_Guide">http://processors.wiki.ti.com/index.php/TI81XX_EDMA_Driver_User_Guide</a>
</p>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4">Programming the EDMA3 using the Low-Level Driver (LLD)</h3>
<div class="outline-text-3" id="text-1-4">

<p><a href="http://processors.wiki.ti.com/index.php/Programming_the_EDMA3_using_the_Low-Level_Driver_(LLD)">http://processors.wiki.ti.com/index.php/Programming_the_EDMA3_using_the_Low-Level_Driver_%28LLD%29</a>
</p></div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5">edma.h File Reference</h3>
<div class="outline-text-3" id="text-1-5">

<p><a href="http://software-dl.ti.com/dsps/dsps_public_sw/sdo_sb/targetcontent/linuxutils/2_24_03/exports/linuxutils_2_24_03/docs/html/edma_8h.html">http://software-dl.ti.com/dsps/dsps_public_sw/sdo_sb/targetcontent/linuxutils/2_24_03/exports/linuxutils_2_24_03/docs/html/edma_8h.html</a>
</p>
</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6">Forum</h3>
<div class="outline-text-3" id="text-1-6">


</div>

<div id="outline-container-1-6-1" class="outline-4">
<h4 id="sec-1-6-1">Which DMA (EDMA or QDMA) channels are used by the Codec Engine and Codec Server in DM6467T DVSDK 3.10?</h4>
<div class="outline-text-4" id="text-1-6-1">

<p><a href="http://e2e.ti.com/support/embedded/linux/f/354/t/140290.aspx?pi36987=1">http://e2e.ti.com/support/embedded/linux/f/354/t/140290.aspx?pi36987=1</a>
</p></div>

</div>

<div id="outline-container-1-6-2" class="outline-4">
<h4 id="sec-1-6-2">DM6467T Linux driver - how to use EDMA</h4>
<div class="outline-text-4" id="text-1-6-2">

<p><a href="http://e2e.ti.com/support/embedded/linux/f/354/p/104964/506774.aspx#506774">http://e2e.ti.com/support/embedded/linux/f/354/p/104964/506774.aspx#506774</a>
</p>

</div>
</div>

</div>

<div id="outline-container-1-7" class="outline-3">
<h3 id="sec-1-7">Trace in Framework Components</h3>
<div class="outline-text-3" id="text-1-7">

<p><a href="http://processors.wiki.ti.com/index.php/Trace_in_Framework_Components">http://processors.wiki.ti.com/index.php/Trace_in_Framework_Components</a>
</p></div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Note from TI81XX EDMA Driver User Guide</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">Introduction</h3>
<div class="outline-text-3" id="text-2-1">

<p>The EDMA3 controller consists of two principal blocks:
</p><ul>
<li>EDMA3 channel controller (EDMA3CC)
</li>
<li>EDMA3 transfer controller(s) (EDMA3TC
</li>
</ul>


</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2">How to reserve different EDMA3 resources (DMA channels, TCCs, PaRAM Sets) on ARM side</h3>
<div class="outline-text-3" id="text-2-2">

<p>The resource allocation in EDMA3 is based on <b>a pre-aligned static configuration</b>. 
</p>
</div>

<div id="outline-container-2-2-1" class="outline-4">
<h4 id="sec-2-2-1">DMA Channels</h4>
<div class="outline-text-4" id="text-2-2-1">

<p>In the source file <code>arch\arm\mach-omap2\devices.c</code>, array
<code>ti816x_dma_rsv_chans[][2]</code> is used to reserve various DMA channels to
the shadow regions of all other masters other than ARM. 
</p>



<pre class="src src-c"><span style="color: #00ffff;">static</span> <span style="color: #00ffff;">const</span> <span style="color: #98fb98;">s16</span> <span style="color: #eedd82;">ti816x_dma_rsv_chans</span>[][2] = {
        <span style="color: #ff7f24;">/* </span><span style="color: #ff7f24;">(offset, number) </span><span style="color: #ff7f24;">*/</span>
        {0, 4},
        {26, 6},
        {48, 4},
        {56, 8},
        {-1, -1}
};
</pre>

<p>
The first entry means 4 channels from channel '0' i.e. channels '0-3'
will be reserved for usage of other masters (for eg. DSP).
</p>
</div>

</div>

<div id="outline-container-2-2-2" class="outline-4">
<h4 id="sec-2-2-2">TCCs (i.e Interrupt channels)</h4>
<div class="outline-text-4" id="text-2-2-2">

<p>It is assumed that if a particular channel number x is reserved for a
particular master then the TCC x is also reserved for that same
master. All drivers and applications running on all masters must keep
this in mind and be programmed.
</p></div>

</div>

<div id="outline-container-2-2-3" class="outline-4">
<h4 id="sec-2-2-3">PaRAM Sets</h4>
<div class="outline-text-4" id="text-2-2-3">

<p>In the source file <code>arch\arm\mach-omap2\devices.c</code>, array
<code>ti816x_dma_rsv_slots[][2]</code> is used to reserve various PARAM sets (slot)
to the shadow regions of all other masters other than ARM. 
</p>



<pre class="src src-c"><span style="color: #00ffff;">static</span> <span style="color: #00ffff;">const</span> <span style="color: #98fb98;">s16</span> <span style="color: #eedd82;">ti816x_dma_rsv_slots</span>[][2] = {
        <span style="color: #ff7f24;">/* </span><span style="color: #ff7f24;">(offset, number) </span><span style="color: #ff7f24;">*/</span>
        {0, 4},
        {26, 6},
        {48, 4},
        {56, 8},
        {64, 127},
        {-1, -1}
};
</pre>

<p>
The first entry means 4 slots from slot '0' i.e. slots '0-3' will be
reserved for usage of other masters (for eg. DSP).
</p>
<p>
 <b>Note 1:</b> DMA channels and PaRAM Sets are one-to-one mapped, meaning
thereby DMA channel X can ONLY use PaRAM Set X for its working. 
</p>
<p>
 <b>Note 2:</b> A DMA/QDMA channel also require a TCC for correct functioning.
By default, DMA channels and TCCs are one-to-one mapped, meaning
thereby DMA channel Y can ONLY use TCC Y for its working. (No such
constraint is there for QDMA channels.) 
</p>
</div>
</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3">How to change various other global settings</h3>
<div class="outline-text-3" id="text-2-3">


</div>

<div id="outline-container-2-3-1" class="outline-4">
<h4 id="sec-2-3-1">How to change default event queue (or Transfer Controller, TC) priorities?</h4>
<div class="outline-text-4" id="text-2-3-1">

<p>Array <code>ti816x_queue_priority_mapping[][2]</code> can be used to change the
default event queue priorities. This array is an array of structures
having the first structure member as the event queue number and the
second structure member as the priority. '0' is the highest priority,
'1' is the second highest and so on. 
</p>



<pre class="src src-c"><span style="color: #00ffff;">static</span> <span style="color: #00ffff;">const</span> <span style="color: #98fb98;">s8</span> <span style="color: #eedd82;">ti816x_queue_priority_mapping</span>[][2] = {
        <span style="color: #ff7f24;">/* </span><span style="color: #ff7f24;">{event queue no, Priority} </span><span style="color: #ff7f24;">*/</span>
        {0, 0},
        {1, 1},
        {2, 2},
        {3, 3},
        {-1, -1}
};
</pre>



</div>
</div>

</div>
