public_html/Embedded System/DM816x/EDMA Notes.html

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4">Present configuration of EDMA3 resources on DM816X platform:</h3>
<div class="outline-text-3" id="text-2-4">

<p>DMA816x
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">EDMA3 Resource</th><th scope="col" class="left">ARM</th><th scope="col" class="left">DSP</th></tr>
</thead>
<tbody>
<tr><td class="left">DMA Channel</td><td class="left">4-25, 32-47, 52-55</td><td class="left">0-3, 26-31, 48-51, 56-63</td></tr>
<tr><td class="left">QDMA Channel</td><td class="left">0,1</td><td class="left">2-7</td></tr>
<tr><td class="left">TCC</td><td class="left">4-25, 32-47, 52-55</td><td class="left">0-3, 26-31, 48-51, 56-63</td></tr>
<tr><td class="left">PaRAM Set</td><td class="left">4-25, 32-47, 52-55, 64-127</td><td class="left">0-3, 26-31, 48-51, 56-63, 128-511</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5">Sample test application for EDMA Driver</h3>
<div class="outline-text-3" id="text-2-5">

<p>EDMA sample test application
<a href="http://processors.wiki.ti.com/index.php/EDMA_sample_test_application">http://processors.wiki.ti.com/index.php/EDMA_sample_test_application</a>
</p>
<p>
Copy this sample application file in a location (preferably not inside
the kernel source code) and build it as a kernel module using a make
file similar to one shown below
</p>



<pre class="src src-sh">obj-m = edma_test.o
<span style="color: #eedd82;">KDIR</span> = <span style="color: #ffa07a;">"../linux-kernel"</span>
all:
        make -C $(KDIR) <span style="color: #eedd82;">M</span>=$(PWD) modules
clean:
        make -C $(KDIR) <span style="color: #eedd82;">M</span>=$(PWD) clean
</pre>




</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Note from Programming the EDMA3 using the Low-Level Driver (LLD)</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1">Abstract</h3>
<div class="outline-text-3" id="text-3-1">

<p>It consists of three (3) libraries:
</p>
<ol>
<li>EDMA3 Resource Manager (RM library)
</li>
<li>EDMA3 Driver (DRV library)
</li>
<li>Chip-specific configuration files (Sample library)
</li>
</ol>


<p>
EDMA3 Low Level Driver:
<a href="http://processors.wiki.ti.com/images/5/5e/EDMA3_LLD.pdf">http://processors.wiki.ti.com/images/5/5e/EDMA3_LLD.pdf</a>
</p>
</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2">Brief Overview of EDMA3</h3>
<div class="outline-text-3" id="text-3-2">

<p>DMA transfers can be triggered 3 different ways: (1) a manual START;
(2) via a sync event from a peripheral; (3) via a chained event - i.e.
the completion of channel x can kick off channel y to start.
</p>
<p>
A basic transfer requires the source address, destination address and
a count value (how much to copy). Source and destination addresses are
fairly obvious. The count value, however, is three-dimensional - ACNT,
BCNT and CCNT. 
</p><ul>
<li>ACNT specifies the number of bytes in an "element". For
  example, for 16-bit audio data, ACNT would be 2 bytes. This is the
  "minimum" transfer size. 
</li>
<li>BCNT specifies the number of "elements" in a
  "frame" or "line".
</li>
<li>CCNT specifies the "block" size or the number of
  frames in the block. Each of these count values max out at 64K. So,
  the max transfer is 64K*64K*64K. 
</li>
</ul>


<p>
For more advanced transfers, the EDMA offers <b>indexing</b> between
transfers for both the source and destination addresses. For example,
if you'd like to bump the src address 4 bytes after each element
transfer, you can set 'BIDX to 4. After the EDMA transfers the first
element, the src address will be indexed 4 bytes (plus or minus) prior
to the next transfer. The destination address has similar indexing
capabilities. Also, 'CIDX can be employed to bump the src or dst
addresses after a "frame" or "line" is transfered. A combination of
these indexes can automatically perform "channel sorting" on incoming
or outgoing data "free of charge" - with no time penalty.
</p>
<p>
The EDMA3 also allows for "<b>linking</b>" and "chaining" capabilities.
Linking is the process of "<b>reloading</b>" a channel's peripheral
configuration registers (or buffer descriptor) with another set after
the first transfer is done. For example, when channel X is complete,
maybe you'd like to transfer the same thing again. Extra "Reload"
parameter sets are available to hold another configuration that can be
"reloaded" automatically into Channel X's registers upon completion of
a transfer. This does NOT start a transfer - it only configures the
channel for the next transfer. "Chaining" is the ability for one
channel's completion to trigger another transfer. For example, if
channel X is chained to channel Y, when channel X completes, it
triggers channel Y to start transferring.
</p>
</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3">Getting to know LLD by example – 9 to show the way</h3>
<div class="outline-text-3" id="text-3-3">

<p>The EDMA LLD itself can be downloaded at:
<a href="http://software-dl.ti.com/dsps/dsps_public_sw/sdo_tii/psp/edma3_lld/index.html">EDMA3 LLD Download Site</a>
</p>
<p>
You can access the code examples at TI's external Gforge site:
</p>
<ul>
<li><a href="https://gforge.ti.com/gf/project/lld_examples/">examples project page (with SVN, notes, files, etc.)</a>
</li>
<li><a href="https://gforge.ti.com/gf/project/lld_examples/frs/">zip-files and PDF document </a>
</li>
</ul>





</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Note from TMS320DM816x DaVinci Video Processors (sprugx8.pdf)<sup><a class="footref" name="fnr-.1" href="#fn-.1">1</a></sup></h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1">5.7 Setting Up a Transfer</h3>
<div class="outline-text-3" id="text-4-1">


</div>

<div id="outline-container-4-1-1" class="outline-4">
<h4 id="sec-4-1-1">Initiating a DMA/QDMA channel</h4>
<div class="outline-text-4" id="text-4-1-1">

<p> (a) Determine the <b>type</b> of channel (QDMA or DMA) to be used.
</p>
<p>
 (b) Channel mapping
</p>
<p>
   (i) If using a QDMA channel, program the <code>DQCHMAP</code> with the parameter
   set number to which the channel maps and the trigger word.
</p>
<p>
   (ii) If using a DMA channel, program the <code>DCHMAP</code> with the parameter set number to which the
   channel maps.
</p>
<p>
(c) If the channel is being used in the context of a shadow region, ensure the <code>DRAE/DRAEH</code> for the
region is properly set up to allow read write accesses to bits in the event registers and interrupt
registers in the Shadow region memory map. The subsequent steps in this process should be done
using the respective shadow region registers.
</p>
<p>
(d) Determine the <b>type of triggering</b> used.
</p>
<p>
(i) If external events are used for triggering (DMA channels), enable
the respective event in <code>EER/EERH</code> by writing into <code>EESR/EESRH</code>.
</p>
<p>
(ii) If QDMA Channel is used, enable the channel in <code>QEER</code> by writing into <code>QEESR</code>.
</p>
<p>
  (e) Queue setup
</p>
<p>   
  (i) If a QDMA channel is used, set up the <code>QDMAQNUM</code> to map the
   channel to the respective event queue.
</p>
<p>  
  (ii) If a DMA channel is used, set up the <code>DMAQNUM</code> to map the event to the respective eventqueue.
</p></div>

</div>

<div id="outline-container-4-1-2" class="outline-4">
<h4 id="sec-4-1-2">Parameter set setup</h4>
<div class="outline-text-4" id="text-4-1-2">

<p>(a) Program the <code>PaRAM set</code> number associated with the channel. Note that if it is a QDMA channel,
the PaRAM entry that is configured as trigger word is written to last. Alternatively, enable the
QDMA channel (step 1-b-ii above) just before the write to the trigger word.
See Section 5.3 for parameter set field setups for different types of
transfers. See the sections on chaining  and interrupt completion on
how to set up final/intermediate completion chaining and/or interrupts.
</p></div>

</div>

<div id="outline-container-4-1-3" class="outline-4">
<h4 id="sec-4-1-3">Interrupt setup</h4>
<div class="outline-text-4" id="text-4-1-3">

<p>(a) Enable the interrupt in the <code>IER/IERH</code> by writing into <code>IESR/IESRH</code>.
</p>
<p>
(b) Ensure that the <code>EDMA3CC</code> completion interrupt (either the global or
the shadow region interrupt) is enabled properly in the device
interrupt controller.
</p>
<p>
(c) Ensure the <code>EDMA3CC</code> completion interrupt (this refers to either the
Global interrupt or the shadow region interrupt) is enabled properly
in the Device Interrupt controller.
</p>
<p>
(d) Set up the interrupt controller properly to receive the expected
EDMA3 interrupt.
</p>
</div>

</div>
