public_html/Embedded System/DM816x/EDMA Notes.html

<div id="outline-container-4-1-4" class="outline-4">
<h4 id="sec-4-1-4">Initiate transfer</h4>
<div class="outline-text-4" id="text-4-1-4">

<p>(a) This step is highly dependent on the event trigger source:
</p>
<p>
(i) If the source is an external event coming from a peripheral, the peripheral will be enabled to
start generating relevant EDMA3 events that can be latched to the ER
transfer.
</p>
<p>
(ii) For QDMA events, writes to the trigger word (step 2-a above) will
initiate the transfer.
</p>
<p>
(iii) Manually triggered transfers will be initiated by writes to the
Event Set Registers (ESR/ESRH).
</p>
<p>
(iv) Chained-trigger events initiate when a previous transfer returns
a transfer completion code equal to the chained channel number.
</p>
</div>

</div>

<div id="outline-container-4-1-5" class="outline-4">
<h4 id="sec-4-1-5">Wait for completion</h4>
<div class="outline-text-4" id="text-4-1-5">

<p>(a) If the interrupts are enabled as mentioned in step 3 above, then
the EDMA3CC will generate a completion interrupt to the CPU whenever
transfer completion results in setting the corresponding bits in the
interrupt pending register (IPR/IPRH). The set bits must be cleared in
the <code>IPR\IPRH</code> by writing to corresponding bit in <code>ICR\ICRH</code>.
</p>
<p>
(b) If polling for completion (interrupts not enabled in the device
controller), then the application code can wait on the expected bits
to be set in the <code>IPR\IPRH</code>. Again, the set bits in the <code>IPR\IPRH</code> must be
manually cleared via <code>ICR\ICRH</code> before the next set of transfers is
performed for the same transfer completion code values.
</p>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn-.1" href="#fnr-.1">1</a></sup> <a href="http://www.ti.com/lit/ug/sprugx8/sprugx8.pdf">http://www.ti.com/lit/ug/sprugx8/sprugx8.pdf</a>
</p>






</div>
</div>
</div>
</div>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-11-29T00:48+0800</p>
<p class="author">Author: Shi Shougang</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.2+ with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
